{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/03/07/hello-world/"},{"title":"读书笔记-普通人的职场进阶课","text":"[潘老师] 职场实战课 - 普通人的职场进阶课。 有用的内容不少，以下只摘录了我画线的一些点。 职业选择与职业规划升职的本质 掌握更多的资源 你可以指挥下属按照你的思路做事，你还负责批复预算，审核定价。也就是说，你对企业资源的控制权在扩大。 更大的实现自我的可能 在一个企业中，高层定方向，中层做规划，基层做执行。高层决定往哪里冲，中层制定冲锋的计划、冲锋的阵型、冲锋的先后顺序，基层大喊一声：冲啊。“砍掉高层的手脚，砍掉中层的屁股，砍掉基层的脑袋”。职位越高，工作的自由度越高，成就感也越高。 提升思维和格局 升职能减少你的信息差，提升思维和格局。 财富自由的本质本质：你不再需要为生活所迫出售时间了。包含2个方面： 你的欲望。 也就是你维持你想要的生活，需要花多少钱。 如果不工作了，你的“睡后”收入能否cover第一条 睡后收入包含：理财、版税、房租等被动收入。 要做的事情： 审视自己的欲望，分辨自己最想要的东西是什么。而不是为了赚钱拼命工作，把身体累垮，错过父母的老去，小孩的成长，成了工作和赚钱的努力。 不同阶层，他们的工作动力和状态是不一样的。比如底层、中产阶级、以创业者为主的富人阶级。作为打工人，你可以不创业，但一定要向创业者学习：以老板的心态去打工，以经营公司的心态来经营自己的职业生涯 职场新常态 上班和下班正在变得模糊 微信，钉钉让打工人处于永恒待机的状态。对于那些习以为常的霸占你所有下班时间的公司，你应该心存警惕。 跳槽变得更加频繁 你要注意积累的是“可迁移的能力”，让你可以从一家公司带到下一家公司。 职业细分深化，新职业层出不穷 e.g., Coser、整理师、网游陪玩、短视频主播等。这些职业可能五年前并不存在，让自己跟上时代，了解年轻人在玩什么，那里面也许隐藏着你的职业机会。 中国企业在国际化 有跨文化工作经验的人，将会更有优势 职场的不确定性也在增加 企业生存周期变短，新业态淘汰旧业态。需要我们终身学习，和世界保持相关性。同时由于互联网对经济的改造，个人IP超级重要，每个人都应该未雨绸缪。 以下是我的一些想法： 利用AI来提高工作效率。需要把ChatGPT用起来。 职业规划的本质相关问题： 该不该从一线城市回老家省会工作 你现在在500强公司，外面一家创业公司加薪30%挖你，要不要去 要不要去考个研究生 “一个人若是看不到未来，就掌控不了现在。一个人若是掌控不了现在，就看不到未来。” 那些不安的人、焦虑的人，他们的解药不在于“眼前的选择题”，而在于“关乎未来的论述题” 好的职业规划，不是喝酒的技巧、给领导回话的技巧、和同事相处的技巧。这些都太浅显、太短期。 好的职业规划，一定是关乎：我是谁，我认为什么是重要的，我应该从事什么职业，我想成为什么样的人。 职业规划的本质：人与岗位的匹配，把“对的人”放在“对的工作”上面。 需要注意的是，并不存在一个“最完美做适合你的工作”。冯唐在书里调侃自己，如果没有当作家和CEO，也许他会是个好的妇科医师和大学教授。 面试跳槽方法论职场沟通技巧简历实战攻略","link":"/2023/03/07/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0-%E6%99%AE%E9%80%9A%E4%BA%BA%E7%9A%84%E8%81%8C%E5%9C%BA%E8%BF%9B%E9%98%B6%E8%AF%BE/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","link":"/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"categories":[],"pages":[{"title":"about","text":"Skills Industrial Robot development Industrial automation development Linux; C/C++/Python Contact E-mail: wumin199@126.com WeChat: Simon_wumin199","link":"/about/index.html"}]}