{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/03/07/hello-world/"},{"title":"工欲善其事","text":"必先利其器 音视频 Abobo 支持对语音、视频进行复读 金舟文字语音转换软件 需开通会员（已是会员） 文字转语音，中英文都可以 可用于中英文单词、句子、段落等的复读学习 也可以语音/视频转文字(效果未测试) 讯飞听译 付费，在线语音转文字，对英文语音识别比较好 有道智云 付费，用的其中的api功能，藤萝英语用到 ACONVERT 在线视频转音频 同时支持音频、视频格式转换 123apps 在线音频视频转换软件 办公 ILovePDF pdf提取、合并、转换 AnyTXT Searcher AnyTXT Searcher 是一款免费、功能强大的本地文档和文本搜索应用程序，无需安装任何其他软件即可提取常用文档的文本，快速找到计算机上存在的任何单词 使用方法 打开AnyTXT Searcher，在搜索框输入关键字。 单击搜索框右侧“+”，修改搜索范围和搜索的文件类型。默认情况下，AnyTXT Searcher搜索本地磁盘的全部文件类型。 单击“开始”。 单击任一搜索结果，可预览匹配的文字片段。可在预览窗口中选择任意字词，右键选择“翻译”，即可调用谷歌或必应翻译。也可在预览窗口下方的搜索框中输入其他关键字，在该文件中进一步搜索。 Everything 查找文件名称 Snipaste 截图软件，目前只有windows Snipaste适用于截小图标和简单的图片标注 PicPick 截图软件，只有windows PicPick适用于截大图和复杂的图片标注 ZLibrary todo 其他 Clash_For_Windows 流量购买 设置方法1localhost, 127.0.0.1/8, ::1","link":"/2023/03/09/%E5%B7%A5%E6%AC%B2%E5%96%84%E5%85%B6%E4%BA%8B/"},{"title":"读书笔记-普通人的职场进阶课","text":"[潘老师] 职场实战课 - 普通人的职场进阶课。 有用的内容不少，以下只摘录了我画线的一些点。 职业选择与职业规划升职的本质 掌握更多的资源你可以指挥下属按照你的思路做事，你还负责批复预算，审核定价。也就是说，你对企业资源的控制权在扩大。 更大的实现自我的可能在一个企业中，高层定方向，中层做规划，基层做执行。高层决定往哪里冲，中层制定冲锋的计划、冲锋的阵型、冲锋的先后顺序，基层大喊一声：冲啊。砍掉高层的手脚，砍掉中层的屁股，砍掉基层的脑袋。职位越高，工作的自由度越高，成就感也越高。 提升思维和格局升职能减少你的信息差，提升思维和格局。 财富自由的本质本质：你不再需要为生活所迫出售时间了。包含2个方面： 你的欲望。也就是你维持你想要的生活，需要花多少钱。 如果不工作了，你的“睡后”收入能否cover第一条睡后收入包含：理财、版税、房租等被动收入。要做的事情：审视自己的欲望，分辨自己最想要的东西是什么。而不是为了赚钱拼命工作，把身体累垮，错过父母的老去，小孩的成长，成了工作和赚钱的努力。不同阶层，他们的工作动力和状态是不一样的。比如底层、中产阶级、以创业者为主的富人阶级。作为打工人，你可以不创业，但一定要向创业者学习：以老板的心态去打工，以经营公司的心态来经营自己的职业生涯 职场新常态 上班和下班正在变得模糊微信，钉钉让打工人处于永恒待机的状态。对于那些习以为常的霸占你所有下班时间的公司，你应该心存警惕。 跳槽变得更加频繁你要注意积累的是“可迁移的能力”，让你可以从一家公司带到下一家公司。 职业细分深化，新职业层出不穷e.g., Coser、整理师、网游陪玩、短视频主播等。这些职业可能五年前并不存在，让自己跟上时代，了解年轻人在玩什么，那里面也许隐藏着你的职业机会。 中国企业在国际化有跨文化工作经验的人，将会更有优势 职场的不确定性也在增加企业生存周期变短，新业态淘汰旧业态。需要我们终身学习，和世界保持相关性。同时由于互联网对经济的改造，个人IP超级重要，每个人都应该未雨绸缪。 以下是我的一些想法： 利用AI来提高工作效率。需要把ChatGPT用起来。 职业规划的本质相关问题： 该不该从一线城市回老家省会工作 你现在在500强公司，外面一家创业公司加薪30%挖你，要不要去 要不要去考个研究生 一个人若是看不到未来，就掌控不了现在。一个人若是掌控不了现在，就看不到未来。 那些不安的人、焦虑的人，他们的解药不在于“眼前的选择题”，而在于“关乎未来的论述题” 好的职业规划，不是喝酒的技巧、给领导回话的技巧、和同事相处的技巧。这些都太浅显、太短期。 好的职业规划，一定是关乎：我是谁，我认为什么是重要的，我应该从事什么职业，我想成为什么样的人。 职业规划的本质：人与岗位的匹配，把“对的人”放在“对的工作”上面。 需要注意的是，并不存在一个“最完美做适合你的工作”。冯唐在书里调侃自己，如果没有当作家和CEO，也许他会是个好的妇科医师和大学教授。 职业规划六部曲没有职业规划，随意跳槽，对个人发展是一种伤害。 了解自己 -&gt; 认识工作世界 -&gt; 确立目标 -&gt; 计划&amp;执行 -&gt; 再评估&amp;成长 -&gt; 觉知&amp;承诺 -&gt; 了解自己 -&gt; … 这六个阶段周而复始，螺旋上升。比如职业测评工具隔3、4年就可以重新做一次，确保自己一直是工作的主人。 了解自己 包含以下4点，可以借助专门的评测工具了解自己。以下4点重要性从高到底，改变程度从难到易。 价值观我是谁，我认为什么东西最重要，什么样的事情让我心中充满了动力。主要的行动驱动力。职场波澜起伏，价值观清晰的人，在职业生涯中有深深的树根，不会在风暴中左右摇晃，不知所措。 性格：我如何与这个世界交互如内外向，喜欢具体事务还是抽象思维，喜欢提前计划还是随机应变 兴趣：我热爱什么，我喜欢什么样的工作 能力：基础能力、专业能力、管理能力 如何看待职业测评工具： 职业测评是有用的 测评的结果不会完全准确 测评不会带来改变，行动才会 人是成长的，需要隔几年进行一次测评 测评工具： 价值观测评先挑出10个最重要的词 -&gt; 划掉相对不重要的2个 -&gt; 划掉相对不重要的3个 -&gt; 划掉相对不重要的2个。每往下一步，都在逼近你的内心。最后剩下3个词是你最珍贵、最重视的东西。问自己一个问题：这3种价值在你现在的工作中得到满足了吗。这3种价值是不能被压迫、被忽略、被轻视的。问自己第二个问题：你为这3种价值花了多少时间。 性格测评：MBTI参考MBTI在线测评,INFJ-介绍MBTI：4个维度，8种类型，16种人格外向(E)&amp;内向(I):精神来源感觉(S)&amp;直觉(N):认识世界思维(T)&amp;情感(F):决策方式判断(J)&amp;知觉(P):生活态度倡导者的完美主义和矜持，使他们几乎没有发泄情绪的选项。这种性格类型的人如果不能找到自己去帮助他人的动力和进行必要的自我照顾与休息之间的平衡，就会筋疲力尽 兴趣测评：霍兰德职业兴趣测评 Y字型技能理论专业能力、管理能力(跨团队协调、项目管理、产品管理、向高层汇报…)、基础能力(听说读写…) 认识工作世界 行业、职业了解 职业生涯曲线了解 不同职业阶段侧重点 有哪些能力可以迁移，需要在职业生涯中持续积累 如何看待工作与生活的平衡 如何平衡个人收入与成长提升 如何获取职场的最新变化 确立长、中、短期职业目标 没有长期目标，你就不知道短期该如何选择。人生是一个自我实现的预言，你不知道自己要去哪，那就连第一步都迈不出去 长期目标要高大上：年薪50万这种目标，格局上不高，难度上不够大。长期目标要与你的“自我”相匹配。 短期目标是长期目标的准备工作，短期目标要遵循SMART原则: Specific/Measurable/Attainable/Relevant/Time-bound。短期目标达成时，记得奖励自己。 一旦长中短期目标制定完成，你对工作就会充满热情，因为你知道每一天的工作，都是在朝着目标靠近，而不是上班像上坟。 制定计划并执行 再评估与成长 实践、听前辈意见、看书etc 觉知与承诺 经过以上阶段，你对自己有新的认知，可能涉及到修改职业路线图，重新对自己承诺。 三种职业燃料行业有起落，公司有兴衰，唯一能陪伴你终生的，是这三份职业燃料。 可迁移的能力 学历、专业证书、特定专业技能（而非特定平台技能） 分析问题的思维方法，条分缕析or一团浆糊 完成任务的能力，涉及任务拆分、沟通协调，涉及项目管理 说服沟通的技巧。这么样结构化沟通，让自己条理清晰；怎么样在沟通中抓住听众的注意力；30s/3min/30分钟的沟通；成交、演讲、说服、即兴演讲有那些表达结构 帮助求助的能力。怎么帮助别人又不让人觉得不舒服；怎么求助，如跨部门求助、重要资源协调、向领导求助、怎么让别人乐意帮你。 提前做功课 推功揽过 互惠互利，礼尚往来 情商。 体察和管理自己的情绪 体察和管理别人的情绪 对人才的吸引力 持久的关系 联系人 领英上的联系人 散落在大厂的前同事 行业上下游的关键联络人有意识的维护这些“弱关系网络”，他们将源源不断向你提供新信息: 平时点赞 送礼 … 专家团结实自己弱项的专家，在你需要的时候向这些专家付费 关键同事顶头上司、上司的上司，关键的同级和下属 支持者和铁杆粉丝一定要用心去经营，对他们好一点 人生导师他们的阶层、眼光、认知碾压你，你觉得极为困难的事情，他可能一句话就点破要害。如果有幸遇到，一定要用心经营。 有意义的经历 大公司工作经历，核心岗位工作经历。如果有机会经历这些，30岁以前不要太纠结于工资。 创业的经历 处理危机的经历，做成了是自己事业背书，做不成也没什么问题 巨大的成就和业绩 Step年度工匠精神 keba年会主持人 xyz的OKR之E 海外工作经历 公开的演讲、写书、发布会、采访，可以增加行业声望。 职业成长曲线 积累期 任务 确定职业方向 培养核心竞争力 注意事项 不宜变动频繁（行业和方向） 关注个人成长（而不只是钱） 跟优秀的人在一起 变现期 面试跳槽方法论职场沟通技巧简历实战攻略","link":"/2023/03/07/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0-%E6%99%AE%E9%80%9A%E4%BA%BA%E7%9A%84%E8%81%8C%E5%9C%BA%E8%BF%9B%E9%98%B6%E8%AF%BE/"}],"tags":[{"name":"工欲善其事","slug":"工欲善其事","link":"/tags/%E5%B7%A5%E6%AC%B2%E5%96%84%E5%85%B6%E4%BA%8B/"},{"name":"读书笔记","slug":"读书笔记","link":"/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"categories":[],"pages":[{"title":"about","text":"Skills Industrial Robot development Industrial automation development Linux; C/C++/Python Contact E-mail: wumin199@126.com WeChat: Simon_wumin199","link":"/about/index.html"}]}